Documents/Перемещение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>Перемещение</Name>
			<BasedOn>
				<xr:Item>Document.ПриходнаяНакладная</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиТовара</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Строк</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФлагНеПроверятьОстатки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Куда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриходнаяНакладная</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партии</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗакупки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаЗакупки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Перемещение/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИмяДокумента = "Перемещение";
	Документы[ИмяДокумента].ЗаполнитьРеквизиты(ЭтаФорма);
	гоФормаСпискаПриСоздании(ЭтаФорма);
	
	глПокраситьВалюты(ЭтаФорма, "Валюта");
	
	// © Primus1C  23.12.2023  НАЧАЛО ►
	
	//2017.03.24
	//Мас = омСервер.МассивСкладов();
	//Если Мас.Количество() <> 0 Тогда 
	//	Список.КомпоновщикНастроек.Настройки.Отбор.Элементы[1].Использование = Истина;
	//	Список.КомпоновщикНастроек.Настройки.Отбор.Элементы[1].Элементы[0].Использование = Истина;
	//	Список.КомпоновщикНастроек.Настройки.Отбор.Элементы[1].Элементы[0].ПравоеЗначение = Мас;
	//	Список.КомпоновщикНастроек.Настройки.Отбор.Элементы[1].Элементы[1].Использование = Истина;
	//	Список.КомпоновщикНастроек.Настройки.Отбор.Элементы[1].Элементы[1].ПравоеЗначение = Мас;
	//КонецЕсли;
	
	глПокраситьПомеченныеНаУдаление(ЭтаФорма);
	гоСтандартныйОтборПоПолю("Склады", Список, "Склад");
	
	СтруктураПечатныхФорм = Документы.Перемещение.ПолучитьСтруктуруПечатныхФорм();  
	ПараметрыРазмещения = Новый Структура("Форма, ЭтоФормаОбъекта, КоманднаяПанель", ЭтаФорма, Ложь, Неопределено);
	ОбщегоНазначенияСервер.ПодключитьКомандыПечати(ПараметрыРазмещения, СтруктураПечатныхФорм);   

	// © Primus1C  ОКОНЧАНИЕ ◄

КонецПроцедуры

&НаСервере
Процедура УстановитьВсеПараметры()
	Документы[ИмяДокумента].УстановитьВсеПараметры(ЭтаФорма);
	УстановитьФирму();
КонецПроцедуры

&НаСервере
Процедура УстановитьФирму(Принудительно = 0)
	Фильтр = гоФирма();
	Если НЕ (Принудительно = 0) Тогда Фильтр = Принудительно КонецЕсли; 
	
	гоСтандартныйОтбор(Список, 0, Истина, Фильтр);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	гоЗаголовокИнтервал(ЭтаФорма, Ложь, Истина);
	УстановитьВсеПараметры();
	гоЖурналПриОткрытии(ЭтаФорма, Отказ);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	гоЖурналПередЗакрытием(ЭтаФорма, Отказ, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	//СтандартнаяОбработка = Ложь;
КонецПроцедуры


#Область ПодключаемаяПечать
	
&НаКлиенте
Процедура ВыполнитьПодключеннуюПечать(Команда)
	
	ВариантПечатнойФормы = СтрЗаменить(Команда.Имя, "ПодключеннаяПечать_", "");   
	ТабДок = ПечатнаяФорма(ВариантПечатнойФормы);
	ПараметрыПечати = Новый Структура("Таб, Имя, НеДляПечати", ТабДок, гоИмя(ТекущийЭлемент.ТекущаяСтрока, Ложь), Ложь);
	ОткрытьФорму("ОбщаяФорма.ПечатьБезЗащиты", ПараметрыПечати, , Истина); 
		
КонецПроцедуры  

&НаСервере
Функция ПечатнаяФорма(ВариантПечатнойФормы)

	ТабДок = Новый ТабличныйДокумент;
	Документы.Перемещение.ПечатьДокумента(ТекущийЭлемент.ТекущаяСтрока, ВариантПечатнойФормы, ТабДок);
	Возврат ТабДок;
	
КонецФункции 

#КонецОбласти
